{
  "class_name": "Model",
  "config": {
    "name": "model_1",
    "layers": [
      {
        "name": "input_1",
        "class_name": "InputLayer",
        "config": {
          "batch_input_shape": [
            null,
            3,
            192,
            624
          ],
          "dtype": "float32",
          "sparse": false,
          "name": "input_1"
        },
        "inbound_nodes": []
      },
      {
        "name": "block1_conv1",
        "class_name": "Conv2D",
        "config": {
          "name": "block1_conv1",
          "trainable": true,
          "filters": 64,
          "kernel_size": [
            3,
            3
          ],
          "strides": [
            1,
            1
          ],
          "padding": "same",
          "data_format": "channels_first",
          "dilation_rate": [
            1,
            1
          ],
          "activation": "relu",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "scale": 1.0,
              "mode": "fan_avg",
              "distribution": "uniform",
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "input_1",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "block1_conv2",
        "class_name": "Conv2D",
        "config": {
          "name": "block1_conv2",
          "trainable": true,
          "filters": 64,
          "kernel_size": [
            3,
            3
          ],
          "strides": [
            1,
            1
          ],
          "padding": "same",
          "data_format": "channels_first",
          "dilation_rate": [
            1,
            1
          ],
          "activation": "relu",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "scale": 1.0,
              "mode": "fan_avg",
              "distribution": "uniform",
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "block1_conv1",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "block1_pool",
        "class_name": "MaxPooling2D",
        "config": {
          "name": "block1_pool",
          "trainable": true,
          "pool_size": [
            2,
            2
          ],
          "padding": "same",
          "strides": [
            2,
            2
          ],
          "data_format": "channels_first"
        },
        "inbound_nodes": [
          [
            [
              "block1_conv2",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "block2_conv1",
        "class_name": "Conv2D",
        "config": {
          "name": "block2_conv1",
          "trainable": true,
          "filters": 128,
          "kernel_size": [
            3,
            3
          ],
          "strides": [
            1,
            1
          ],
          "padding": "same",
          "data_format": "channels_first",
          "dilation_rate": [
            1,
            1
          ],
          "activation": "relu",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "scale": 1.0,
              "mode": "fan_avg",
              "distribution": "uniform",
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "block1_pool",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "block2_conv2",
        "class_name": "Conv2D",
        "config": {
          "name": "block2_conv2",
          "trainable": true,
          "filters": 128,
          "kernel_size": [
            3,
            3
          ],
          "strides": [
            1,
            1
          ],
          "padding": "same",
          "data_format": "channels_first",
          "dilation_rate": [
            1,
            1
          ],
          "activation": "relu",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "scale": 1.0,
              "mode": "fan_avg",
              "distribution": "uniform",
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "block2_conv1",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "block2_pool",
        "class_name": "MaxPooling2D",
        "config": {
          "name": "block2_pool",
          "trainable": true,
          "pool_size": [
            2,
            2
          ],
          "padding": "same",
          "strides": [
            2,
            2
          ],
          "data_format": "channels_first"
        },
        "inbound_nodes": [
          [
            [
              "block2_conv2",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "block3_conv1",
        "class_name": "Conv2D",
        "config": {
          "name": "block3_conv1",
          "trainable": true,
          "filters": 256,
          "kernel_size": [
            3,
            3
          ],
          "strides": [
            1,
            1
          ],
          "padding": "same",
          "data_format": "channels_first",
          "dilation_rate": [
            1,
            1
          ],
          "activation": "relu",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "scale": 1.0,
              "mode": "fan_avg",
              "distribution": "uniform",
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "block2_pool",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "block3_conv2",
        "class_name": "Conv2D",
        "config": {
          "name": "block3_conv2",
          "trainable": true,
          "filters": 256,
          "kernel_size": [
            3,
            3
          ],
          "strides": [
            1,
            1
          ],
          "padding": "same",
          "data_format": "channels_first",
          "dilation_rate": [
            1,
            1
          ],
          "activation": "relu",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "scale": 1.0,
              "mode": "fan_avg",
              "distribution": "uniform",
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "block3_conv1",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "block3_conv3",
        "class_name": "Conv2D",
        "config": {
          "name": "block3_conv3",
          "trainable": true,
          "filters": 256,
          "kernel_size": [
            3,
            3
          ],
          "strides": [
            1,
            1
          ],
          "padding": "same",
          "data_format": "channels_first",
          "dilation_rate": [
            1,
            1
          ],
          "activation": "relu",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "scale": 1.0,
              "mode": "fan_avg",
              "distribution": "uniform",
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "block3_conv2",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "block3_pool",
        "class_name": "MaxPooling2D",
        "config": {
          "name": "block3_pool",
          "trainable": true,
          "pool_size": [
            2,
            2
          ],
          "padding": "same",
          "strides": [
            2,
            2
          ],
          "data_format": "channels_first"
        },
        "inbound_nodes": [
          [
            [
              "block3_conv3",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "block4_conv1",
        "class_name": "Conv2D",
        "config": {
          "name": "block4_conv1",
          "trainable": true,
          "filters": 512,
          "kernel_size": [
            3,
            3
          ],
          "strides": [
            1,
            1
          ],
          "padding": "same",
          "data_format": "channels_first",
          "dilation_rate": [
            1,
            1
          ],
          "activation": "relu",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "scale": 1.0,
              "mode": "fan_avg",
              "distribution": "uniform",
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "block3_pool",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "block4_conv2",
        "class_name": "Conv2D",
        "config": {
          "name": "block4_conv2",
          "trainable": true,
          "filters": 512,
          "kernel_size": [
            3,
            3
          ],
          "strides": [
            1,
            1
          ],
          "padding": "same",
          "data_format": "channels_first",
          "dilation_rate": [
            1,
            1
          ],
          "activation": "relu",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "scale": 1.0,
              "mode": "fan_avg",
              "distribution": "uniform",
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "block4_conv1",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "block4_conv3",
        "class_name": "Conv2D",
        "config": {
          "name": "block4_conv3",
          "trainable": true,
          "filters": 512,
          "kernel_size": [
            3,
            3
          ],
          "strides": [
            1,
            1
          ],
          "padding": "same",
          "data_format": "channels_first",
          "dilation_rate": [
            1,
            1
          ],
          "activation": "relu",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "scale": 1.0,
              "mode": "fan_avg",
              "distribution": "uniform",
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "block4_conv2",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "block4_pool",
        "class_name": "MaxPooling2D",
        "config": {
          "name": "block4_pool",
          "trainable": true,
          "pool_size": [
            2,
            2
          ],
          "padding": "same",
          "strides": [
            2,
            2
          ],
          "data_format": "channels_first"
        },
        "inbound_nodes": [
          [
            [
              "block4_conv3",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "block5_conv1",
        "class_name": "Conv2D",
        "config": {
          "name": "block5_conv1",
          "trainable": true,
          "filters": 512,
          "kernel_size": [
            3,
            3
          ],
          "strides": [
            1,
            1
          ],
          "padding": "same",
          "data_format": "channels_first",
          "dilation_rate": [
            1,
            1
          ],
          "activation": "relu",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "scale": 1.0,
              "mode": "fan_avg",
              "distribution": "uniform",
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "block4_pool",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "block5_conv2",
        "class_name": "Conv2D",
        "config": {
          "name": "block5_conv2",
          "trainable": true,
          "filters": 512,
          "kernel_size": [
            3,
            3
          ],
          "strides": [
            1,
            1
          ],
          "padding": "same",
          "data_format": "channels_first",
          "dilation_rate": [
            1,
            1
          ],
          "activation": "relu",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "scale": 1.0,
              "mode": "fan_avg",
              "distribution": "uniform",
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "block5_conv1",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "block5_conv3",
        "class_name": "Conv2D",
        "config": {
          "name": "block5_conv3",
          "trainable": true,
          "filters": 512,
          "kernel_size": [
            3,
            3
          ],
          "strides": [
            1,
            1
          ],
          "padding": "same",
          "data_format": "channels_first",
          "dilation_rate": [
            1,
            1
          ],
          "activation": "relu",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "scale": 1.0,
              "mode": "fan_avg",
              "distribution": "uniform",
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "block5_conv2",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "conv2d_1",
        "class_name": "Conv2D",
        "config": {
          "name": "conv2d_1",
          "trainable": true,
          "filters": 3,
          "kernel_size": [
            1,
            1
          ],
          "strides": [
            1,
            1
          ],
          "padding": "same",
          "data_format": "channels_first",
          "dilation_rate": [
            1,
            1
          ],
          "activation": "linear",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "scale": 1.0,
              "mode": "fan_avg",
              "distribution": "uniform",
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "block1_conv2",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "conv2d_2",
        "class_name": "Conv2D",
        "config": {
          "name": "conv2d_2",
          "trainable": true,
          "filters": 3,
          "kernel_size": [
            1,
            1
          ],
          "strides": [
            1,
            1
          ],
          "padding": "same",
          "data_format": "channels_first",
          "dilation_rate": [
            1,
            1
          ],
          "activation": "linear",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "scale": 1.0,
              "mode": "fan_avg",
              "distribution": "uniform",
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "block2_conv2",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "conv2d_3",
        "class_name": "Conv2D",
        "config": {
          "name": "conv2d_3",
          "trainable": true,
          "filters": 3,
          "kernel_size": [
            1,
            1
          ],
          "strides": [
            1,
            1
          ],
          "padding": "same",
          "data_format": "channels_first",
          "dilation_rate": [
            1,
            1
          ],
          "activation": "linear",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "scale": 1.0,
              "mode": "fan_avg",
              "distribution": "uniform",
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "block3_conv3",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "conv2d_4",
        "class_name": "Conv2D",
        "config": {
          "name": "conv2d_4",
          "trainable": true,
          "filters": 3,
          "kernel_size": [
            1,
            1
          ],
          "strides": [
            1,
            1
          ],
          "padding": "same",
          "data_format": "channels_first",
          "dilation_rate": [
            1,
            1
          ],
          "activation": "linear",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "scale": 1.0,
              "mode": "fan_avg",
              "distribution": "uniform",
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "block4_conv3",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "conv2d_5",
        "class_name": "Conv2D",
        "config": {
          "name": "conv2d_5",
          "trainable": true,
          "filters": 3,
          "kernel_size": [
            1,
            1
          ],
          "strides": [
            1,
            1
          ],
          "padding": "same",
          "data_format": "channels_first",
          "dilation_rate": [
            1,
            1
          ],
          "activation": "linear",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "scale": 1.0,
              "mode": "fan_avg",
              "distribution": "uniform",
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "block5_conv3",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "conv2d_transpose_1",
        "class_name": "Conv2DTranspose",
        "config": {
          "name": "conv2d_transpose_1",
          "trainable": true,
          "filters": 3,
          "kernel_size": [
            2,
            2
          ],
          "strides": [
            1,
            1
          ],
          "padding": "same",
          "data_format": "channels_first",
          "activation": "linear",
          "use_bias": false,
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "scale": 1.0,
              "mode": "fan_avg",
              "distribution": "uniform",
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "conv2d_1",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "conv2d_transpose_2",
        "class_name": "Conv2DTranspose",
        "config": {
          "name": "conv2d_transpose_2",
          "trainable": true,
          "filters": 3,
          "kernel_size": [
            4,
            4
          ],
          "strides": [
            2,
            2
          ],
          "padding": "same",
          "data_format": "channels_first",
          "activation": "linear",
          "use_bias": false,
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "scale": 1.0,
              "mode": "fan_avg",
              "distribution": "uniform",
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "conv2d_2",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "conv2d_transpose_3",
        "class_name": "Conv2DTranspose",
        "config": {
          "name": "conv2d_transpose_3",
          "trainable": true,
          "filters": 3,
          "kernel_size": [
            8,
            8
          ],
          "strides": [
            4,
            4
          ],
          "padding": "same",
          "data_format": "channels_first",
          "activation": "linear",
          "use_bias": false,
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "scale": 1.0,
              "mode": "fan_avg",
              "distribution": "uniform",
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "conv2d_3",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "conv2d_transpose_4",
        "class_name": "Conv2DTranspose",
        "config": {
          "name": "conv2d_transpose_4",
          "trainable": true,
          "filters": 3,
          "kernel_size": [
            16,
            16
          ],
          "strides": [
            8,
            8
          ],
          "padding": "same",
          "data_format": "channels_first",
          "activation": "linear",
          "use_bias": false,
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "scale": 1.0,
              "mode": "fan_avg",
              "distribution": "uniform",
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "conv2d_4",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "conv2d_transpose_5",
        "class_name": "Conv2DTranspose",
        "config": {
          "name": "conv2d_transpose_5",
          "trainable": true,
          "filters": 3,
          "kernel_size": [
            32,
            32
          ],
          "strides": [
            16,
            16
          ],
          "padding": "same",
          "data_format": "channels_first",
          "activation": "linear",
          "use_bias": false,
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "scale": 1.0,
              "mode": "fan_avg",
              "distribution": "uniform",
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "conv2d_5",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "maximum_1",
        "class_name": "Maximum",
        "config": {
          "name": "maximum_1",
          "trainable": true
        },
        "inbound_nodes": [
          [
            [
              "conv2d_transpose_1",
              0,
              0,
              {}
            ],
            [
              "conv2d_transpose_2",
              0,
              0,
              {}
            ],
            [
              "conv2d_transpose_3",
              0,
              0,
              {}
            ],
            [
              "conv2d_transpose_4",
              0,
              0,
              {}
            ],
            [
              "conv2d_transpose_5",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "conv2d_6",
        "class_name": "Conv2D",
        "config": {
          "name": "conv2d_6",
          "trainable": true,
          "filters": 3,
          "kernel_size": [
            1,
            1
          ],
          "strides": [
            1,
            1
          ],
          "padding": "same",
          "data_format": "channels_first",
          "dilation_rate": [
            1,
            1
          ],
          "activation": "linear",
          "use_bias": false,
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "scale": 1.0,
              "mode": "fan_avg",
              "distribution": "uniform",
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "inbound_nodes": [
          [
            [
              "maximum_1",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "reshape_1",
        "class_name": "Reshape",
        "config": {
          "name": "reshape_1",
          "trainable": true,
          "batch_input_shape": [
            null,
            3,
            192,
            624
          ],
          "dtype": "float32",
          "target_shape": [
            3,
            119808
          ]
        },
        "inbound_nodes": [
          [
            [
              "conv2d_6",
              0,
              0,
              {}
            ]
          ]
        ]
      },
      {
        "name": "permute_1",
        "class_name": "Permute",
        "config": {
          "name": "permute_1",
          "trainable": true,
          "dims": [
            2,
            1
          ]
        },
        "inbound_nodes": [
          [
            [
              "reshape_1",
              0,
              0,
              {}
            ]
          ]
        ]
      }
    ],
    "input_layers": [
      [
        "input_1",
        0,
        0
      ]
    ],
    "output_layers": [
      [
        "permute_1",
        0,
        0
      ]
    ]
  },
  "keras_version": "2.2.0",
  "backend": "tensorflow"
}